Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P10.tmx
Source language: en_us
Languages: zh_cn

source: Ashes
zh_cn: 灰烬

source: I'm at work on Saturday when I get the call.
zh_cn: 星期六那天接到电话时我正在上班。

source: Carina, from the front counter, pages me over the intercom and when I finally get to the phone it's my older brother, Jano, telling me I might want to sit down because he has upsetting news.
zh_cn: 卡丽娜从前台用对讲机找到了我。等拿起电话，我才知道是哥哥哈诺打来的。他让我最好坐下来，因为有个不幸的消息要告诉我。

source: "Tell me," I say.
zh_cn: “你讲吧。”我说道。

source: "Do you have a chair?"
zh_cn: “你坐好了吗？”

source: "Just tell me."
zh_cn: “赶紧说吧。”

source: What I have is a hollow feeling in my stomach the size of a coconut.
zh_cn: 我感觉胃里发虚，好像那里有了一个椰子般大小的洞。

source: "Mama's gone," he says.
zh_cn: “咱妈去世了。”他说。

source: "What?"
zh_cn: “什么？”

source: My heart seizes.
zh_cn: 我的心紧缩成一团。

source: "Se?ora López found her today."
zh_cn: “洛佩斯太太今天发现的。”

source: "Found her?
zh_cn: “发现？

source: Where was Papi?"
zh_cn: 咱爸去哪儿了？”

source: "Are you sitting down?" he asks again.
zh_cn: “你坐好了没有？”他又问了一遍。

source: "Stop asking me that.
zh_cn: “别总问这个。

source: Why can't you just answer my questions?"
zh_cn: 你就不能回答我的问题？”

source: "It's a little bit complicated, O.K.?"
zh_cn: “这事儿有点复杂。”

source: "How?"
zh_cn: “怎么个复杂法？”

source: But he won't answer that, either.
zh_cn: 可这个问题他也不愿回答。

source: He just suggests we meet when I get off work because we have a lot of things to take care of.
zh_cn: 他只是建议我下班之后碰个面，因为我们还有很多事情要处理。

source: I'm not supposed to use the phone during work hours, but I call Armando as soon as I hang up.
zh_cn: 虽说在上班时间内我不应该用电话，可和哈诺讲完后，我还是马上给阿曼德拨了个电话。

source: I hold the plastic beige contraption trembling next to my ear as I talk.
zh_cn: 通话的时候，我用手攥着耳朵边上抖个不停的灰色电话线。

source: He tells me I should take off early, that my boss will understand because this is an extenuating circumstance.
zh_cn: 他说我应该可以提前下班，我的老板会理解的，因为毕竟情有可原。

source: Armando's never had to work anywhere like this, though, and he doesn't get the idea that I'm just a body doing a job, not somebody doing it.
zh_cn: 阿曼德以前从没在这种环境里干过活儿，他不明白，我在老板眼里只是个干活的躯壳，而不是一个大活人。

source: Still, I tell him I'll try.
zh_cn: 不过，我还是告诉他我会尽量试试。

source: He leaves me with "We can go out for dinner if you want. You don't have to cook."
zh_cn: 他最后跟我说“如果你愿意，咱们今晚就到外面吃饭好了，这样你不必做饭。”

source: I end up staying at Casa de la Carne for my whole shift.
zh_cn: 我最终还是留在了“肉之家”工厂把班上完。

source: Work helps keep my mind off everything.
zh_cn: 干活可以让我什么都不想。

source: If I'd left early, I would have been a blubbering thing sitting on the curb in the parking lot- the way I can be only in private, or sometimes, when he's being nice, with Armando. Never in front of my family.
zh_cn: 如果提前走，我肯定会坐在停车场边的马路牙子上哭得一塌糊涂。这种事儿只有在我独自一人的时候才能做出来。或者要是赶上阿曼德那阵子对我好的话，我也可以当着他做出来但是我绝不在自己家里人面前这么做。

source: I know they think I'm more heartless than them for that, but I know the truth.
zh_cn: 我知道他们因此觉得我的心肠比他们硬，可我自己心里清楚。

source: I know my depths.
zh_cn: 我知道深浅。

source: The story is that she had a heart attack.
zh_cn: 原来我妈是犯了心脏病。

source: She was cooking- like she was always cooking- and she simply fell over on the kitchen floor.
zh_cn: 当时她正在像平常一样做饭，然后突然就倒在了厨房地板上。

source: Papi was sitting in a wooden chair at the kitchen table, probably smoking a cigarette while she worked, waiting to be served.
zh_cn: 我爸那时坐在餐桌边的木椅子上，也许还抽着烟，看她做饭，等着吃现成的。

source: She fell right at his feet.
zh_cn: 她正好就倒在他脚边。

source: We think he tried to help her, tried to blow air into her mouth, pumping and puffing.
zh_cn: 我们觉得他大概也试着去救过她，往她嘴里吹气，给她按压心脏什么的。

source: Jano says Papi picked up the phone but couldn't remember the number for emergency, and, after trying a jumble of numbers over and over again, he just gave up.
zh_cn: 哈诺说我爸拿起了电话，可是想不起急救电话的号码了，胡乱地试了一次又一次之后，他干脆放弃了。

source: "Why didn't he call one of us?" I say when I see Jano after work.
zh_cn: 我下班后见到哈诺时问他：“为什么他不给咱们俩随便哪个打电话呢？”

source: Jano shrugs.
zh_cn: 哈诺耸耸肩。

source: "I don't think he really knew what was happening."
zh_cn: “我觉得他根本就不明白当时到底是怎么回事。”

source: We both know Papi is sick, mentally gone, but we never talk about him in those terms.
zh_cn: 我们俩都知道我爸有病，脑子已经完了。可是我们从没那么说起过他。

source: We like to pretend he's just old.
zh_cn: 我们宁愿假装他只是老了。

source: When Sra. López got there this morning, she found Papi sitting in the wooden chair with the phone still in his hand, buzzing because it was off the hook.
zh_cn: 今天早上洛佩斯太太到那里的时候，她见到我爸手里还拿着电话，坐在木椅子上。电话因为摘了机，还在滴滴作响。

source: She saw Mama at his feet.
zh_cn: 她看见我妈倒在他的脚下。

source: "The oven was on, too," Jano says.
zh_cn: “连炉子上的火都还没关掉。”哈诺说道。

source: "There could have been a fire on top of everything else."
zh_cn: “本来已经够乱的了，还差点再来把火。”

source: He shakes his head.
zh_cn: 他边说边摇头。

source: Sra. López pried the phone from Papi's hands and called Jano.
zh_cn: 洛佩斯太太把电话从我爸手里掰下来，然后给哈诺打了电话。

source: That was earlier today.
zh_cn: 那是今天早些时候的事情。

source: "Papi's going to stay with me now," Jano says.
zh_cn: “咱爸往后就跟我住吧。”哈诺说道。

source: "I don't think he can be alone."
zh_cn: “我觉得他一个人没法过。”

source: "He can stay with me," I say.
zh_cn: “他可以跟我住啊。”我说。

source: Jano shakes his head. "Uh-uh."
zh_cn: 哈诺摇着头说：“不行不行。”

source: "Why not?"
zh_cn: “为什么不行？”

source: "He'll like it at our house better."
zh_cn: “他会更喜欢我们那里。”

source: "My place is fine."
zh_cn: “我那儿也挺好。”

source: "What?" Jano asks.
zh_cn: “怎么？”哈诺问道。

source: "You have a newfound interest in him?"
zh_cn: “你对他又重新感兴趣了？”

source: "Do you?"
zh_cn: “那你呢？”

source: We're at an ice-cream shop near my work.
zh_cn: 那时我们是在我单位附近的一个冰激淋店里坐着。

source: The cold air has turned Jano's lips slightly purple.
zh_cn: 冷气把哈诺的嘴唇吹得有点发紫。

source: Besides an employee in a pink apron, we're the only people here.
zh_cn: 店里除了一个系着粉色围裙的店员之外，就只有我们俩。

source: The bright lights bounce off the white counters and smack me in the face.
zh_cn: 从白色柜台上反射过来的亮光，直直地砸到我的脸上。

source: I'm quiet for a minute. Then I start on a reel of questions. How does he know it was a heart attack?
zh_cn: 我静了一会儿，然后开始连珠炮似地发问：他怎么知道是心脏病？

source: What are we going to do now?
zh_cn: 我们现在该怎么办？

source: What's happening to the house?
zh_cn: 那所房子怎么办？

source: Is his wife, Zenia, O.K. with Papi being there?
zh_cn: 我嫂子珍妮亚答应我爸住他们那儿吗？

source: What else did Papi say?
zh_cn: 我爸还说了些什么？

source: Why did Sra. López call him instead of me?
zh_cn: 洛佩斯太太为什么给他打电话，而没给我打？

source: He answers every one.
zh_cn: 每个问题他都回答了。

source: He's unusually patient with me.
zh_cn: 他对我表现出格外的耐心。

source: He's waiting to see if I'll break, I know, if this will be the thing that puts me over the edge, brave-faced little Mireya.
zh_cn: 我知道他在等着看我是不是会掉泪，看这件事会不会把我——外表坚强的小玛利亚——压垮。

source: The last time I saw her, my mother was sitting with me on her patio.
zh_cn: 上一次去见我妈的时候，我和她坐在门外的平台上。

source: She was in the metal rocking chair she'd had since before I was born, olive-green seat cushions and floral ironwork along the arms.
zh_cn: 她坐的那个金属摇椅，是在生我之前就有了的，铺着橄榄绿的坐垫，还有带花纹的铸铁扶手。

source: She had her legs stretched out in front of her, knee-high nylons rolled down around her crossed ankles like life preservers, terry house slippers on her feet.
zh_cn: 她把双腿伸在身子前面，膝盖高的尼龙袜向下卷到脚踝，活像两个救生圈，脚上套着毛绒拖鞋。

source: She looked relaxed as she lectured me on her favorite subject- politics.
zh_cn: 她看上去很放松，滔滔不绝地跟我说着她最喜欢的话题——政治。

source: She was telling me how fortunate it was that she had named me Mireya, because the President of Panama was Mireya Moscoso.
zh_cn: 她提起当初给我起名叫做玛利亚，是多么幸运的一件事，因为现在巴拿马的总统就叫玛利亚·摩斯科索。

source: She must have said about ten times, "That could have been you," as if the only prerequisite for becoming the President was having the right name.
zh_cn: 她说了差不多有十遍“没准你也能成。”，好像当总统的唯一条件就是把名字取对。

source: She hated that politics held no interest for me.
zh_cn: 我对政治的漠不关心让我妈非常痛心。

source: The one thing my mother liked about Armando was his appetite for the political.
zh_cn: 她唯一喜欢阿曼德的地方，就是他对政治十分关注。

source: Just for that, of all the people in my family, she was his only fan.
zh_cn: 就因为这个，她成为他在我家人中唯一的粉丝。

source: That day, there was an election parade in the neighborhood.
zh_cn: 那天在我家附近有一场竞选游行。

source: Martin Torrijos was riding all over our section of town, shouting from the windows of his van and waving a Panamanian flag in a bid to become the next President.
zh_cn: 马丁·托里霍斯的竞选车队在我们家那边的街道上经过。他从所坐的面包车窗口向外叫喊着，还挥着一面巴拿马国旗，想要成为下届总统。

source: It was the reason we were outside on the patio.
zh_cn: 我们就是因为这个才坐在外面的。

source: My mother was waiting for him.
zh_cn: 我妈一直在等着他过来。

source: We'd been talking for almost an hour when his big white van, followed by pickup trucks with speakers on the flatbeds blasting music, rumbled up our street.
zh_cn: 我们聊了差不多一个小时，他的那辆白色大面包车才开过来，后面跟着一些小卡车，在敞开的车厢里架着高音喇叭，不停地播着音乐，把我们这条街吵得鸡犬不宁。

source: My mother stood and smoothed out the front of her robe.
zh_cn: 我妈站起身，把衣服的前身理平整。

source: She was old enough that her spine had begun to bow.
zh_cn: 她已经老得开始有些驼背了。

source: Torrijos stopped his van in front of our patio.
zh_cn: 托里霍斯让面包车在我们的平台前停下来。

source: He asked my mother how she and her sister, meaning me, were doing.
zh_cn: 他向我妈和她的妹妹（也就是我）问好。

source: My mother shouted, "What will you do about the hospitals?"
zh_cn: 我妈喊道：“你要把医院怎么样？”

source: Torrijos smiled and waved.
zh_cn: 托里霍斯微笑着挥挥手。

source: "And what about the canal?" she yelled into the sunlight.
zh_cn: “还有，运河怎么办？”她顶着阳光喊道。

source: Torrijos tossed a T-shirt out the window to her.
zh_cn: 托里霍斯从车窗里向她扔过一件T恤衫。

source: "For you!" he shouted.
zh_cn: “送给你！”他叫道。

source: My mother let it land at her feet.
zh_cn: 我妈任由它落在脚边。

source: "Pendejo!" she shouted, and the van continued up the street.
zh_cn: “蠢货！”她喊道。面包车继续往前开去。

source: It wasn't everyone who would call a politician an idiot to his face.
zh_cn: 不是所有人都有胆当着一个政客的面叫他白痴。

source: I smiled until I thought my cheeks would burst.
zh_cn: 我笑得简直合不上嘴。

source: I'd always felt there was something special between my mother and me.
zh_cn: 我一直觉得我妈和我之间有某种特殊联系。

source: Like she was somehow more mine than Jano's.
zh_cn: 好像她更属于我，而不属于哈诺。

source: But maybe all children feel that- a sovereignty of ownership over the parent they love best.
zh_cn: 不过也许所有的儿女都有类似的感受，他们对自己最爱的家长拥有主权。

source: When I get home that night, Armando sprints out to see me.
zh_cn: 晚上我回到家，阿曼德跑过来迎我。

source: "Pobrecita," he says. He's making a face like I'm a puppy with a broken leg.
zh_cn: “可怜的宝贝儿。”他说道，脸上的表情好像我是条断了腿的小狗。

source: "I have a poem for you."
zh_cn: “我要送给你首诗。”

source: "Another one?"
zh_cn: “又是一首？”

source: "When was the last one?" he asks, leaning over the kitchen table, reaching for a book.
zh_cn: “上一首是什么时候？”他问道，然后把身子探过餐桌，拿过一本书。

source: He finds the page he wants and says, "It's by Cesar Vallejo.
zh_cn: 他找到想要找的那页，说：“这是凯撒·瓦拉霍写的。

source: He's one of the great writers. He wrote for the people."
zh_cn: 他是一位为人民而写作的著名作家。”

source: I sit down as he reads it to me.
zh_cn: 我坐下来，他开始给我念。

source: I don't understand poetry the way he does.
zh_cn: 我对诗歌的理解不如他。

source: Things either sound good to me or they don't. That's it.
zh_cn: 对我来说，它要么好听，要么不好听，就这么简单。

source: The poem he reads tonight is short.
zh_cn: 那晚他念的诗歌很短。

source: It's about the poet's brother, who died.
zh_cn: 是关于诗人去世的兄弟。

source: My favorite line is "And now a shadow falls on the soul."
zh_cn: 我最喜欢的一句是“现在阴霾覆盖了灵魂。”

source: I feel the tears burn behind my eyes.
zh_cn: 我觉得泪水就在眼眶里打转。

source: "It's nice," I say when he's done.
zh_cn: “挺好的。”他念完之后我说。

source: Then I quickly scoot my chair back and head for the shower.
zh_cn: 然后我迅速向后挪开椅子，进浴室洗澡。

source: Under the spray, the meat juices wash from my fingernails, from my pores.
zh_cn: 喷头把肉汁从我的指甲下和毛孔中冲走。

source: I tilt my head back and let the water stream down my face until I can't tell anymore where the water ends and my tears begin.
zh_cn: 我向后仰起头，让水流滑下我的脸颊，直到我分不出哪些是热水，哪些是泪水。

source: Armando comes in after me.
zh_cn: 阿曼德随后跟了进来。

source: He knows this is my place to cry.
zh_cn: 他知道这里是我哭泣的地方。

source: He peels off his clothes and steps into the stall and tries to hold me.
zh_cn: 他扒下衣服，走进淋浴抱住我。

source: His dark, moppish hair sticks to the sides of his face.
zh_cn: 黑色墩布般的头发粘在他的脸侧。

source: His skin slips over mine.
zh_cn: 他的皮肤贴到我身上。

source: He pushes me out of the water and examines my eyes.
zh_cn: 他把我从喷头下推开，然后端详着我的眼睛。

source: "Are the tears gone now?"
zh_cn: “眼泪现在流完了吗？”

source: I shrug.
zh_cn: 我耸耸肩。

source: "Tell me, Mireya," he pleads.
zh_cn: “告诉我，玛利亚。”他恳求道。

source: It's the split second of something in his voice that, despite everything else, makes me love him.
zh_cn: 尽管有其它种种不满，但那一瞬间他声音里的某种东西，使我仍然爱他。

source: "I think they're just starting," I say.
zh_cn: “我觉得它们才刚刚开始。”我说。

source: He bends down and licks one cheek, then the other, gently, with the tip of his tongue.
zh_cn: 他俯下身，温柔的舌尖轻舔着我的脸颊。先是一侧，然后是另一侧。

source: "I'll get them," he says, and he does.
zh_cn: “我来清理它们。”他说道。他也确实做到了。

source: My father cleaned government buildings at night.
zh_cn: 我爸的工作是在夜里清扫政府的大楼。

source: He came home in the early morning hours, high on ammonia and bleach, and made my mother prepare dinner for him in the dark.
zh_cn: 他每天后半夜才回家，满身都是氨水和漂白水的味道，让我妈摸黑给他准备晚饭。

source: When he worked overtime, she cooked dinner as the sun rose.
zh_cn: 有时加班回来晚了，她得在日出的时候做晚饭。

source: Many nights, the smell of spicy chicken or ropa vieja woke me and I knew that my father had just arrived.
zh_cn: 有很多夜晚，我在辣子鸡或大杂烩的香味里醒来，明白我爸一定是刚回家。

source: During the day, he should have been sleeping, but more often he was out in bars or with other women or smoking on our front step, ashes fluttering in the air like confetti.
zh_cn: 白天的时候，他应该在家里补觉。可是他通常是去外面的酒吧，或找别的女人，要不就是坐在我家门前的台阶上抽烟，把烟灰扬得像是庆典上撒下的彩屑。

source: My mother was never happy with him.
zh_cn: 我妈跟他在一起的时候从来都不开心。

source: I mean, she must have been at one time, but I'd never witnessed it.
zh_cn: 我觉得，她以前肯定也曾经开心过，只不过我从来没见到而已。

source: I'd hear her, at night, through the thin walls, sobbing in her room.
zh_cn: 在夜里，透过薄薄的墙板，我曾听见她在自己房间里的哭泣声。

source: She knew about everything my father did- I often heard them arguing about his carryings-on- but, for all her strength, she was never able to stop him and never able to walk away.
zh_cn: 她清楚我爸在外面做的一切——我常常听见他们为他的那些破事争吵——可是，尽管她那么坚强，却从来没能阻止得了他，也没能下狠心离开他。

source: There was one time when I thought she came close.
zh_cn: 只有一次我觉得她几乎做到了。

source: My father had taken a job cleaning houses during the day and at some point he started returning home with hair dryers, mixing bowls, toaster ovens, picture frames.
zh_cn: 那时我爸找了份白天打扫房间的活儿，后来他开始不断往家里带回东西，吹风机、和面盆、小烤箱、相框等等。

source: Of course, we knew where these things were coming from.
zh_cn: 我们当然都知道东西是从哪儿来的。

source: No one said anything, though, until a police officer showed up at our house one afternoon asking questions.
zh_cn: 可是谁也没提起过一个字。直到有天下午一个警察上门来问。

source: It was easy enough to get rid of him- my father offered him a speaker system- but I'd never seen my mother so angry.
zh_cn: 搞定警察很容易——我爸用一套扬声器就把他打发了——可是我却从没见我妈那么生气过。

source: For a whole week, she spoke to him only once, when she told him, "You shamed me."
zh_cn: 那之后整整一个星期，我妈只跟他说了一次话。她说的是：“你真让我抬不起头来。”

source: The only time I even saw a moment of affection between them was much later, after Jano had married and I had moved out on my own.
zh_cn: 我唯一一次见到他们俩之间温情脉脉的时候，是在这事儿过去很久之后。哈诺已经结婚，我自己也已搬出去住。

source: My father had retired, and they were living off his pension and the odd lottery payout.
zh_cn: 我爸那时已经退休，他们就靠着他的退休金和偶尔中点彩票的收入度日。

source: My mother had asked me to get some melons at the stand near my house and bring them over.
zh_cn: 我妈让我从住处附近的一个摊子上买些甜瓜带过去。

source: She was very particular about which melons she deemed acceptable.
zh_cn: 她对甜瓜的要求非常严格，只认可某个特别的品种。

source: When I got there, the front door was wide open and inside I saw them, sitting on our old peach-colored couch, my father at one end and my mother stretched out at the other, her feet propped on his lap.
zh_cn: 等我买好带到他们那里时，房门大敞着，我可以看见他们坐在屋里那个桃色的旧沙发上，我爸坐在一头，我妈躺在另一头，她的脚搁在他的膝盖上。

source: He was tickling the soles of her feet with his fingertips and she was flinching, but laughing.
zh_cn: 他用手指尖轻轻挠着她的脚心，她在笑着躲闪。

source: Then he reached over and cupped her hair behind her ear.
zh_cn: 然后他伸过手去，把她的头发拢到耳后。

source: She followed the movement of his hand with her head, like a horse.
zh_cn: 她的头配合着他手上的动作，就像一匹马儿。

source: That was all. But there was real tenderness in it.
zh_cn: 虽然就这么简单，不过那里面满是柔情蜜意。

source: Armando is Argentinean, a different breed.
zh_cn: 阿曼德来自阿根廷，完全是另外一种人。

source: We met when I was on my way out of work one afternoon, heading for the bus.
zh_cn: 我们是在有天下午我下班之后，去车站的路上遇到的。

source: He must have been standing there for hours, surveying every so-and-so who walked by.
zh_cn: 他当时一定已经在那儿站了好几个小时，不停打量过往的行人。

source: I'm not beautiful. I know that.
zh_cn: 我不漂亮，这我知道。

source: I'm just this girl with my mother's squash-shaped body, and dense black hair and a mole on my right cheek.
zh_cn: 我只是个普通女孩，从我妈那里继承下来一副扁平身材，头发又黑又密，右颊上还有一颗痣。

source: But I always thought it meant something that he seized on me.
zh_cn: 可是我一直觉得，那天他能主动找上我，说明我也还行。

source: Came right up to me and said, "You look like you could use a decent meal.
zh_cn: 他径直走到我跟前，说：“你看上去需要好好吃上顿饭了。
